# Before we go...

If you have already ran the code, you may need to delete the file "test.db" to avoid errors when running it again. The cell below test if this is the case and delete it automatically.

In [1]:
import os

# Looking for test.db and removing it when the file exists:
if(os.path.isfile("test.db")):
    os.remove("test.db")
    print("Removed test.db!")

# Example - CRUD basics

This notebook presents simple examples on how to work with basic SQL CRUD (Create, Read, Update and Delete) functionalities through CREATE, SELECT, UPDATE and DELETE statements.

The cell below connects to the "test.db" database file, and if the file do not exists it will be created. The CREATE statement can be used to create a new Table on the "test" database.

In [2]:
import sqlite3

conn = sqlite3.connect('test.db')
print ("Opened database successfully")

try:
    conn.execute('''
            CREATE TABLE COMPANY
             (ID         INT PRIMARY KEY   NOT NULL,
             NAME        TEXT              NOT NULL,
             AGE         INT               NOT NULL,
             ADDRESS     CHAR(50),
             SALARY      REAL);
        ''')
    print("Table created successfully!")
except:
    print("The table could not be created. Please check if it already exists!")
conn.close()

Opened database successfully
Table created successfully!

Adding single rows of data to our brand-new table using the INSERT statement. All the commands just need to be written using SQL statements and executed via the execute() function, as we did in the cell above.

In [3]:
conn = sqlite3.connect('test.db')
print ("Opened database successfully")

conn.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) \
    VALUES (1, 'George', 30, 'New York', 32000.00 )")

conn.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) \
    VALUES (2, 'Paul', 28, 'Delaware', 25000.00 )")

conn.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) \
    VALUES (3, 'David', 19, 'Kansas', 18000.00 )")

conn.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) \
    VALUES (4, 'Steven', 31, 'Florida', 50000.00 )")

conn.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) \
    VALUES (5, 'John', 27, 'Colorado', 30000.00 )")

conn.commit()
print ("Records created successfully")
conn.close()

Opened database successfully
Records created successfully

The new data do not need to be added by single INSERT + execute() calls, but a longer SQL statement can be used.

In [4]:
conn = sqlite3.connect('test.db')
print ("Opened database successfully")

conn.execute('''
    INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY)
    VALUES (6, 'Mary', 28, 'Maryland', 35000.00 ),
           (7, 'Jefferson', 22, 'Minnesota', 31000.00 ),
           (8, 'John', 27, 'Colorado', 30000.00 ),
           (9, 'Kim', 29, 'Michigan', 43000.00 ),
           (10, 'Anne', 25, 'New York', 25000.00 )
''')

conn.commit()
print ("Records created successfully")

Opened database successfully
Records created successfully

Let's see how our table is becoming getting its data using a SELECT statement:

In [5]:
conn = sqlite3.connect('test.db')
print ("Opened database successfully")

cursor = conn.execute("SELECT * FROM COMPANY")
for row in cursor:
    print(row)

conn.close()

Opened database successfully
(1, 'George', 30, 'New York', 32000.0)
(2, 'Paul', 28, 'Delaware', 25000.0)
(3, 'David', 19, 'Kansas', 18000.0)
(4, 'Steven', 31, 'Florida', 50000.0)
(5, 'John', 27, 'Colorado', 30000.0)
(6, 'Mary', 28, 'Maryland', 35000.0)
(7, 'Jefferson', 22, 'Minnesota', 31000.0)
(8, 'John', 27, 'Colorado', 30000.0)
(9, 'Kim', 29, 'Michigan', 43000.0)
(10, 'Anne', 25, 'New York', 25000.0)

When working with SQL + Python, we can iterate through the SQL cursor like it was a Python tuple:

In [6]:
conn = sqlite3.connect('test.db')
print ("Opened database successfully")

cursor = conn.execute("SELECT id, name, address, salary from COMPANY")
for row in cursor:
    print ("ID = ", row[0])
    print ("NAME = ", row[1])
    print ("ADDRESS = ", row[2])
    print ("SALARY = ", row[3], "\n")

conn.close()

Opened database successfully
ID =  1
NAME =  George
ADDRESS =  New York
SALARY =  32000.0

ID =  2
NAME =  Paul
ADDRESS =  Delaware
SALARY =  25000.0

ID =  3
NAME =  David
ADDRESS =  Kansas
SALARY =  18000.0

ID =  4
NAME =  Steven
ADDRESS =  Florida
SALARY =  50000.0

ID =  5
NAME =  John
ADDRESS =  Colorado
SALARY =  30000.0

ID =  6
NAME =  Mary
ADDRESS =  Maryland
SALARY =  35000.0

ID =  7
NAME =  Jefferson
ADDRESS =  Minnesota
SALARY =  31000.0

ID =  8
NAME =  John
ADDRESS =  Colorado
SALARY =  30000.0

ID =  9
NAME =  Kim
ADDRESS =  Michigan
SALARY =  43000.0

ID =  10
NAME =  Anne
ADDRESS =  New York
SALARY =  25000.0

We can use the UPDATE statement to change values in a table of a database.

In [7]:
conn = sqlite3.connect('test.db')
print ("Opened database successfully")

conn.execute("UPDATE COMPANY set SALARY = 35000.00 where ID = 1")
conn.commit()
print ("Total number of rows updated :", conn.total_changes)

cursor = conn.execute("SELECT id, name, address, salary from COMPANY")
for row in cursor:
    print (row)

conn.close()

Opened database successfully
Total number of rows updated : 1
(1, 'George', 'New York', 35000.0)
(2, 'Paul', 'Delaware', 25000.0)
(3, 'David', 'Kansas', 18000.0)
(4, 'Steven', 'Florida', 50000.0)
(5, 'John', 'Colorado', 30000.0)
(6, 'Mary', 'Maryland', 35000.0)
(7, 'Jefferson', 'Minnesota', 31000.0)
(8, 'John', 'Colorado', 30000.0)
(9, 'Kim', 'Michigan', 43000.0)
(10, 'Anne', 'New York', 25000.0)

Finally, the DELETE statement being used to remove a row from the table.

In [8]:
conn = sqlite3.connect('test.db')
print ("Opened database successfully")

conn.execute("DELETE from COMPANY where ID = 2;")
conn.commit()
print ("Total number of rows deleted :", conn.total_changes)

cursor = conn.execute("SELECT id, name, address, salary from COMPANY")
for row in cursor:
    print (row)

conn.close()

Opened database successfully
Total number of rows deleted : 1
(1, 'George', 'New York', 35000.0)
(3, 'David', 'Kansas', 18000.0)
(4, 'Steven', 'Florida', 50000.0)
(5, 'John', 'Colorado', 30000.0)
(6, 'Mary', 'Maryland', 35000.0)
(7, 'Jefferson', 'Minnesota', 31000.0)
(8, 'John', 'Colorado', 30000.0)
(9, 'Kim', 'Michigan', 43000.0)
(10, 'Anne', 'New York', 25000.0)